#### NamingUtils Members

---

|  |
| --- |
| NamingUtils Class   Methods   See Also |

The  NamingUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CompareNames | Compares two object name strings using Revit's comparison rules. |
| Public method Static member | IsValidName | Identifies if the input string is valid for use as an object name in Revit. |

# See Also

NamingUtils Class

Autodesk.Revit.DB Namespace